{"backend": "tensorflow", "config": {"name": "model_1", "layers": [{"config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 64, 64, 1]}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "name": "conv2d_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last"}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"rate": 0.25, "name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "name": "conv2d_2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last"}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"rate": 0.25, "name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "name": "conv2d_3", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last"}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"rate": 0.25, "name": "dropout_3", "trainable": true, "noise_shape": null, "seed": null}, "name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "name": "conv2d_4", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last"}, "name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "name": "max_pooling2d_4", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"rate": 0.25, "name": "dropout_4", "trainable": true, "noise_shape": null, "seed": null}, "name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "name": "conv2d_5", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last"}, "name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_5", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "name": "max_pooling2d_5", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"rate": 0.25, "name": "dropout_5", "trainable": true, "noise_shape": null, "seed": null}, "name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"config": {"name": "flatten_5", "trainable": true, "data_format": "channels_last"}, "name": "flatten_5", "class_name": "Flatten", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "name": "output_font", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 11, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax"}, "name": "output_font", "class_name": "Dense", "inbound_nodes": [[["flatten_5", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "name": "output_char", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 94, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax"}, "name": "output_char", "class_name": "Dense", "inbound_nodes": [[["flatten_5", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "name": "output_bold", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "sigmoid"}, "name": "output_bold", "class_name": "Dense", "inbound_nodes": [[["flatten_5", 0, 0, {}]]]}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "name": "output_italics", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "sigmoid"}, "name": "output_italics", "class_name": "Dense", "inbound_nodes": [[["flatten_5", 0, 0, {}]]]}], "output_layers": [["output_font", 0, 0], ["output_char", 0, 0], ["output_bold", 0, 0], ["output_italics", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.0"}