__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 64, 64, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 64, 64, 64)   640         input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 32, 32, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32, 32, 64)   0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 64)   36928       dropout_1[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 16, 16, 64)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 16, 16, 64)   0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 16, 16, 64)   36928       dropout_2[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 8, 8, 64)     0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 8, 8, 64)     0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 8, 8, 64)     36928       dropout_3[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 4, 4, 64)     0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 4, 4, 64)     0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 4, 4, 64)     36928       dropout_4[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 2, 2, 64)     0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 2, 2, 64)     0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 256)          0           dropout_5[0][0]                  
__________________________________________________________________________________________________
output_font (Dense)             (None, 11)           2827        flatten_5[0][0]                  
__________________________________________________________________________________________________
output_char (Dense)             (None, 94)           24158       flatten_5[0][0]                  
__________________________________________________________________________________________________
output_bold (Dense)             (None, 2)            514         flatten_5[0][0]                  
__________________________________________________________________________________________________
output_italics (Dense)          (None, 2)            514         flatten_5[0][0]                  
==================================================================================================
Total params: 176,365
Trainable params: 176,365
Non-trainable params: 0
__________________________________________________________________________________________________
